{
  "138": {
    "id": 138,
    "title": "Keynote Panel",
    "description": "Panel Discussion",
    "image": "/images/backgrounds/closing.jpg",
    "location": "Auditorium",
    "colspan": true
  },
  "137": {
    "id": 137,
    "title": "Closing / General Survey / Give-aways",
    "description": "Let's Celebrate and Give Some Goodies AWAY. This session's rating is the general survey of the event. You must complete it (and at least another session's rating) to be entered into the raffle.",
    "image": "/images/backgrounds/party.jpg",
    "location": "Auditorium",
    "colspan": true
  },
  "136": {
    "id": 136,
    "title": "Welcome",
    "description": "Official start of the conference. Greetings from the organizers, sponsors and partners.",
    "image": "/images/backgrounds/opening.jpg",
    "location": "Auditorium",
    "colspan": true
  },
  "133": {
    "id": 133,
    "title": "Lunch & Tabling Session",
    "description": "Foooooooood!",
    "image": "/images/backgrounds/lunch.jpg",
    "location": "Parking Lot",
    "colspan": true
  },
  "132": {
    "id": 132,
    "title": "Registration & Breakfast",
    "description": "Get your badge, coffee, enjoy talking with tech edicts around",
    "image": "/images/backgrounds/registration.jpg",
    "location": "Lobby",
    "colspan": true
  },
  "115": {
    "id": 115,
    "title": "Priming the Pipeline: Supporting Young Female Coders",
    "description": "What challenges do girls and young women face that leads to their underrepresentation in technology? What is being done now to increase female participation while school districts and the State of California move slowly to address the lack of Computer Science curriculum in public schools? What has been the response of students to after-school coding clubs at Fresno Unified? Is the model gaining momentum and is it scalable? What does the future hold for CoderGirlz? Saori will address these questions and more as she shares her experiences starting and growing coding clubs for girls.",
    "speakers": [
      1
    ],
    "complexity": "Beginner",
    "tags": [
      "Tech Talks"
    ]
  },
  "114": {
    "id": 114,
    "title": "Cloud Next",
    "description": "First we take a look at what Google Cloud has to offer and relate its services to other major cloud providers' features. We'll watch and discuss interesting sessions of the recent Google Cloud Next Conference. Everyone wth a laptop (BYOD) can participate in code labs (see resource links below). Participants of codelab who excel will receive various prizes. Please don't forget to fill out the separate attendee survey (see first resource link below) for this Cloud Next part of the event.",
    "speakers": [
      9, 13, 12
    ],
    "complexity": "Intermediate",
    "tags": [
      "Cloud Next"
    ],
    "resources": [
        {
            "type": "link",
            "title": "Attendee Survey",
            "href": "https://docs.google.com/a/google.com/forms/d/e/1FAIpQLSfA95161xkfywPrAnEcTodsv993qHzo7BlIojexB0P3rvSBrg/viewform"
        },
        {
            "type": "presentation",
            "title": "Slide Deck",
            "href": "https://docs.google.com/presentation/d/194CM8Lf675ff95inQwfxq1IOC5ATxH_nctRe0ki0fVQ/edit?usp=sharing"
        },
        {
            "type": "link",
            "title": "Cloud Next Code Labs",
            "href": "https://codelabs.developers.google.com/next17"
        },
        {
            "type": "video",
            "title": "Cloud Next Sessions",
            "href": "https://www.youtube.com/playlist?list=PLIivdWyY5sqI8RuUibiH8sMb1ExIw0lAR"
        },
        {
            "type": "link",
            "title": "Free Coursera Code Labs",
            "href": "http://www.coursera.org/voucher/googlenext"
        },
        {
            "type": "link",
            "title": "GCP Next Code Labs",
            "href": "https://codelabs.developers.google.com/gcp-next"
        },
        {
            "type": "link",
            "title": "QwikLabs GCP Quest",
            "href": "https://google.qwiklabs.com/quests/23?locale=en"
        }
    ]
  },
  "113": {
    "id": 113,
    "title": "The Entrepreneur's Battle Plan: 5 Tips for Taking Your Mountain",
    "description": "While we all hope to have an enjoyable journey as entrepreneurs and professionals, the fact is, when you are decide to start your own business, you have also decided to embark on one of the toughest journeys of your life!  Being properly prepared for what you will face along the way is critical for your ultimate success.  From vision, to plan, to courage, and self-care, the way of the business owner is much like being in battle.  This talk will help you understand the key areas to strengthen in order for you to successfully \"take your mountain.\" ",
    "speakers": [
      11
    ],
    "complexity": "Beginner",
    "tags": [
      "Tech Talks"
    ]
  },
  "112": {
    "id": 112,
    "title": "You're Never Too Young To Code!",
    "description": "The jobs our children will have in the future probably don't exist yet.  But they don't have to wait until then to start building the skills they will need.  Coding opportunities allow for true 21st century experiences even for the youngest of children.  My young daughters and I welcome you to join us as we present activities, books, apps, devices, and online resources that can help you open your child to the world of coding!",
    "speakers": [
      2
    ],
    "complexity": "Beginner",
    "tags": [
      "Tech Talks"
    ]
  },
  "111": {
    "id": 111,
    "title": "Improving Communication with Special Needs Children Through Tech",
    "description": "Technology was my window into my son Wyatt's world. As many may remember from last year's talk, my son Wyatt has autism and has overcome a myriad of challenges in the past 8 years. He was fascinated by my iPod & liked interacting with a device. At the time he was completely nonverbal - so this quickly blossomed into spontaneous communication that was previously impossible. He was reading before talking & digital created a means for him to share his thoughts & needs. I'd like to talk about the benefit & use of tech for bridging communication gaps with special needs children - and the need for future innovation in tech to continue improved supports. I will provide example apps that deliver benefit, talk about specific \"light bulb\" moments along our journey, and discuss ways to create your own solutions when you really need a custom-fit.",
    "speakers": [
      6
    ],
    "complexity": "Beginner",
    "tags": [
      "Tech Talks"
    ]
  },
  "110": {
    "id": 110,
    "title": "The Upside Down Approach To Launching an App",
    "description": "This session will discuss how to launch and market a mobile application utilizing  little budget, little time and random/ out of the box methods to approach the intended demographic.",
    "speakers": [
      8
    ],
    "complexity": "Beginner",
    "tags": [
      "Tech Talks"
    ]
  },
  "109": {
    "id": 109,
    "title": "'Real World' not 'Hello World' advanced iOS, Android & React native development",
    "description": "The current way native mobile development is taught is at best incomplete and at worst completely misinformative.  This session will be presenting a more holistic way of learning or expanding a developer's understanding of building for native mobile iOS & Android.  We begin by showing the absolute beginner the highest quality resources needed to learn (free).  Then the session discusses what most mobile developers wish they knew before they started.  The best libraries, tools, tips, tricks and common mistakes to avoid before writing the first line of code.  We follow with a review of how major companies develop mobile apps internally by exploring their open source projects and current publications regarding their latest advancements in native iOS & Android mobile development.  We conclude by discussing the key issues behind using analytics to drive distribution and monetization.",
    "speakers": [
      7
    ],
    "complexity": "Beginner",
    "tags": [
      "Tech Talks"
    ],
    "resources": [
        {
            "type": "presentation",
            "title": "Slide deck",
            "href": "https://goo.gl/4UHlNY"
        }
    ]
  },
  "108": {
    "id": 108,
    "title": "Creative Code: Programming on the Right Side of the Brain",
    "description": "The current mantra seems to be \"Everyone Can Learn to Code\" and yet most of the languages and environments we teach were created for, and by, tech-minded people. What about the rest of us? Well, there is another way. In fact, there is a whole world of artists and designers who program. Join Fresno State Professor Rusty Robison and see what \"right-brained\" people have created and the tools that have helped them become creative coders.",
    "speakers": [
      5
    ],
    "complexity": "Beginner",
    "tags": [
      "UI/UX Design"
    ]
  },
  "107": {
    "id": 107,
    "title": "UI Design for AR: thinking past the screen",
    "description": "Augmented reality (AR) allows for the blending of digital and physical worlds. Recently, there have been exciting advances in AR technology. AR is changing how we interact with devices and our environment to consume content. How will designing user interfaces (UI) for AR be different than traditional screen based designs? What ethical consideration should we be taking into account during UI design? The user experience of AR will greatly benefit from designers considering UI design though the changing lens of augmented reality as a medium.",
    "speakers": [
      3
    ],
    "complexity": "Beginner",
    "tags": [
      "UI/UX Design"
    ]
  },
  "106": {
    "id": 106,
    "title": "Pixel Push: How to Conquer as a UI/UX Designer ",
    "description": "I absolutely love being a designer and I would love to share tips on how to master your craft and build confidence as a female UI/UX designer in the tech world.",
    "speakers": [
      4
    ],
    "complexity": "beginner",
    "tags": [
      "UI/UX Design"
    ],
    "resources": [
        {
            "type": "presentation",
            "title": "Slide Deck (keynote)",
            "href": "https://drive.google.com/file/d/0B1ehBSP0_ewmcDFtOUNRWWl0MDQ/view"
        },
        {
            "type": "presentation",
            "title": "Slide Deck (pptx)",
            "href": "https://drive.google.com/file/d/0B1ehBSP0_ewmR3lxdlhlUlhacGM/view"
        }
    ]
  },
  "105": {
    "id": 105,
    "title": "MakerSpace",
    "description": "So many activities to choose from: 1. Scribblebots: You will be able to build a scribblebot, a small device that uses markers to move, then take it and the art it makes home. 2. 3D Printing: You will have a selection of 6 different models all taking no more than 20 minutes to print. 3. LED Wearables: You will make a wearable piece of equipment that incorporates a color changing LED. 4. Arduinos: Attendees will have the opportunity to use Arduinos to light LEDs as well as complete challenges. 5+. And even more!!!",
    "speakers": [
      10
    ],
    "complexity": "Intermediate",
    "tags": [
      "Makerspace"
    ]
  },
  "104": {
    "id": 104,
    "title": "Cloud Next",
    "description": "We'll watch and discuss interesting sessions of the recent Google Cloud Next Conference. Everyone wth a laptop (BYOD) can participate in code labs (see resource links below). Participants of codelab who excel will receive various prizes. Please don't forget to fill out the separate attendee survey (see first resource link below) for this Cloud Next part of the event.",
    "speakers": [
      9, 13, 12
    ],
    "complexity": "Intermediate",
    "tags": [
      "Cloud Next"
    ],
    "resources": [
        {
            "type": "link",
            "title": "Attendee Survey",
            "href": "https://docs.google.com/a/google.com/forms/d/e/1FAIpQLSfA95161xkfywPrAnEcTodsv993qHzo7BlIojexB0P3rvSBrg/viewform"
        },
        {
            "type": "presentation",
            "title": "Slide Deck",
            "href": "https://docs.google.com/presentation/d/194CM8Lf675ff95inQwfxq1IOC5ATxH_nctRe0ki0fVQ/edit?usp=sharing"
        },
        {
            "type": "link",
            "title": "Cloud Next Code Labs",
            "href": "https://codelabs.developers.google.com/next17"
        },
        {
            "type": "video",
            "title": "Cloud Next Sessions",
            "href": "https://www.youtube.com/playlist?list=PLIivdWyY5sqI8RuUibiH8sMb1ExIw0lAR"
        },
        {
            "type": "link",
            "title": "Free Coursera Code Labs",
            "href": "http://www.coursera.org/voucher/googlenext"
        },
        {
            "type": "link",
            "title": "Cloud Next Code Labs",
            "href": "https://codelabs.developers.google.com/gcp-next"
        },
        {
            "type": "link",
            "title": "QwikLabs GCP Quest",
            "href": "https://google.qwiklabs.com/quests/23?locale=en"
        }
    ]
  }

}
